from prefect import Flow, task
from datetime import timedelta
from prefect.schedules import IntervalSchedule

@task
def PrintLongName():
    print("My name is: S̸̩͇̪̖̐̈́̅͆ê̸͚̜̈́̚ḍ̵̡͓̻̄̌̀ ̷͉̲̞͍͋̑́̊͝ų̴̒̽̅́ṭ̷̨͔͑̈́̈́̈̚ ̸̨͕̋̾̀̚͠p̵̜͋̃͒̈́͒ë̴̘́͛̀r̷̢̛͊͐̕ṣ̶̪̺̳̈́͆̒p̴̨̛͉͚̦̗͆͛́ḯ̷̱́͗c̴̞̗̗̮͛́i̵̩͓͎̞̊ą̴̢͚̹̖̑̍̄̿ẗ̴̨̛͙̳̠̺i̴̡͚̟̰̅͝s̷̻̙̼͈̈́̈̂̓ ̴̧̬̎u̶̜͋̔̀̌̈́n̸̛͉̹̞̄̍͘d̵͈͙͆́̄͐͂e̷͇͒͝͠ ̵̡́̓o̴̥̎̐m̸͓̳͈̏̃n̴͎͗͒̎i̸̼̥̅s̸͎̤͂ ̸̢̡̩̞͔̾̓ī̶̥̐͊s̵͓͉̩͔̓t̷̜͊̓̓͝͠ȩ̶̬̥̥̹̋̆̑ ̸͙̇͌̾̚ṇ̷̨̼̳̽̌a̷̢͊̓t̴̡̟͑̑̽͒͐ǔ̶̩͈͆s̴̱͈̉̈̑ ̷̣̙̼̳̈́̓̾͜e̷̡̹͖̣̒r̴̼̼̍͛̕̚ͅr̴̰̬͗o̶̙̫̙͊r̸̮̜̭͗͝ͅ ̸̣̀̒̇̆ś̶̛̲̦̮̻͙͘i̵̠͕̩̖͚̓̓̎̀ṯ̸̨̮͈̬̑͗͂ ̶̖͋v̵̨̀o̶̳̯̭̞̮̽ḷ̵̡̘̮͖̃̃̉̉̔u̵̼͙͙͂ṕ̶̗̹̽̔̏̑t̵͕̺̋̿̒̓a̴̛̗̼̍̕͠t̷̙͆̾͗̊̔ė̶͈̯͕͇̔͆̆̈́m̷̨͓͓͉̑ ̷͈͎̤̖̊͘ạ̷̺̝̏̄̌́c̶̛̱̎̀͝c̴͎̭̐̿̊̿û̴͍̻̓̍͠ş̷̳̘͈͔̏ã̷̧̰͍͆̉̾̋ņ̶̳̞̞̤̄̈́͝ẗ̸̼̙̻́̇į̷̧̝̬̽͒̆u̸̬̱̯̖̬͋̑ṃ̶͍̍ ̶̡͙̼́͋d̴̨̯̺̯̦̒͊̑̉͆ǫ̷̧̭̹̂͐l̴̩͇̳̦͇͌o̴̭̺̓̑͝r̵̛̪̫̜̮͙̿̑̕e̴͉̔̆͋m̸̗̝͓͈̜̐̉̾͒q̸̧̧̜̩̬̈́̽u̵̘̯̘̽̈̑̓ę̶̱̲̩͍͂̂͛̃͘ ̶̛̣͕̩̤͋͌͒l̴̻̇͑̇͒͊ȃ̸͙̏ù̷̥̄͒d̶̻̞̤͜͝å̶̱n̵̢̲͕͑͌͋͘t̴͍͓͕̆̿î̷̻̲̙̋ủ̵̬̇͒̈́m̵̧̯̗̱̹̿̎,̸͓̔ ̵̟̤̤̜͜͝ṭ̸̻̮̉́͒o̵͓̮͆̍t̸̛̘̫̩͈͍̔ǎ̵͔͈̟̽m̷͈͔̝̠̔̓̓ ̶͚̤̞̥̮̌̐̈́ŕ̷̨̭͈ȩ̴̡̨͍̈́͐m̷̹̞͈̐̍͐̑͘ ̷̡̮͕̀ǡ̷̞̚ṗ̶̗͇͎͉̂̒̕e̸̱̐̋͋̚r̴̙̤͎̱͇͋̐͠i̸̧̨̛̋ā̷̢͉͂̆̐̍m̵͈͖͈̀.̸̦̀͑̉͜ͅ")

schedule = IntervalSchedule(interval=timedelta(minutes=666))

with Flow("S̸̩͇̪̖̐̈́̅͆ê̸͚̜̈́̚ḍ̵̡͓̻̄̌̀ ̷͉̲̞͍͋̑́̊͝ų̴̒̽̅́ṭ̷̨͔͑̈́̈́̈̚ ̸̨͕̋̾̀̚͠p̵̜͋̃͒̈́͒ë̴̘́͛̀r̷̢̛͊͐̕ṣ̶̪̺̳̈́͆̒p̴̨̛͉͚̦̗͆͛́ḯ̷̱́͗c̴̞̗̗̮͛́i̵̩͓͎̞̊ą̴̢͚̹̖̑̍̄̿ẗ̴̨̛͙̳̠̺i̴̡͚̟̰̅͝s̷̻̙̼͈̈́̈̂̓ ̴̧̬̎u̶̜͋̔̀̌̈́n̸̛͉̹̞̄̍͘d̵͈͙͆́̄͐͂e̷͇͒͝͠ ̵̡́̓o̴̥̎̐m̸͓̳͈̏̃n̴͎͗͒̎i̸̼̥̅s̸͎̤͂ ̸̢̡̩̞͔̾̓ī̶̥̐͊s̵͓͉̩͔̓t̷̜͊̓̓͝͠ȩ̶̬̥̥̹̋̆̑ ̸͙̇͌̾̚ṇ̷̨̼̳̽̌a̷̢͊̓t̴̡̟͑̑̽͒͐ǔ̶̩͈͆s̴̱͈̉̈̑ ̷̣̙̼̳̈́̓̾͜e̷̡̹͖̣̒r̴̼̼̍͛̕̚ͅr̴̰̬͗o̶̙̫̙͊r̸̮̜̭͗͝ͅ ̸̣̀̒̇̆ś̶̛̲̦̮̻͙͘i̵̠͕̩̖͚̓̓̎̀ṯ̸̨̮͈̬̑͗͂ ̶̖͋v̵̨̀o̶̳̯̭̞̮̽ḷ̵̡̘̮͖̃̃̉̉̔u̵̼͙͙͂ṕ̶̗̹̽̔̏̑t̵͕̺̋̿̒̓a̴̛̗̼̍̕͠t̷̙͆̾͗̊̔ė̶͈̯͕͇̔͆̆̈́m̷̨͓͓͉̑ ̷͈͎̤̖̊͘ạ̷̺̝̏̄̌́c̶̛̱̎̀͝c̴͎̭̐̿̊̿û̴͍̻̓̍͠ş̷̳̘͈͔̏ã̷̧̰͍͆̉̾̋ņ̶̳̞̞̤̄̈́͝ẗ̸̼̙̻́̇į̷̧̝̬̽͒̆u̸̬̱̯̖̬͋̑ṃ̶͍̍ ̶̡͙̼́͋d̴̨̯̺̯̦̒͊̑̉͆ǫ̷̧̭̹̂͐l̴̩͇̳̦͇͌o̴̭̺̓̑͝r̵̛̪̫̜̮͙̿̑̕e̴͉̔̆͋m̸̗̝͓͈̜̐̉̾͒q̸̧̧̜̩̬̈́̽u̵̘̯̘̽̈̑̓ę̶̱̲̩͍͂̂͛̃͘ ̶̛̣͕̩̤͋͌͒l̴̻̇͑̇͒͊ȃ̸͙̏ù̷̥̄͒d̶̻̞̤͜͝å̶̱n̵̢̲͕͑͌͋͘t̴͍͓͕̆̿î̷̻̲̙̋ủ̵̬̇͒̈́m̵̧̯̗̱̹̿̎,̸͓̔ ̵̟̤̤̜͜͝ṭ̸̻̮̉́͒o̵͓̮͆̍t̸̛̘̫̩͈͍̔ǎ̵͔͈̟̽m̷͈͔̝̠̔̓̓ ̶͚̤̞̥̮̌̐̈́ŕ̷̨̭͈ȩ̴̡̨͍̈́͐m̷̹̞͈̐̍͐̑͘ ̷̡̮͕̀ǡ̷̞̚ṗ̶̗͇͎͉̂̒̕e̸̱̐̋͋̚r̴̙̤͎̱͇͋̐͠i̸̧̨̛̋ā̷̢͉͂̆̐̍m̵͈͖͈̀.̸̦̀͑̉͜ͅ", schedule) as  LongName_Flow:
    PrintLongName()